In [2]:
import pandas as pd

In [17]:
tup_data1 = ('영인', '2010-05-01', '여', True)
tup_data2 = ('철수', '2011-02-01', '남', True)
list_column =['이름', '생년월일', '성별', '학생여부']
sr1 = pd.Series(tup_data1)
sr2 = pd.Series(tup_data2)

In [24]:
df = pd.DataFrame([sr1, sr2])

In [25]:
df

    0           1  2     3
0  영인  2010-05-01  여  True
1  철수  2011-02-01  남  True